       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLHOST.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY LATECFG.
       PROCEDURE DIVISION.
       1000-MAIN.
           CALL 'EXTBANK'
           STOP RUN.
