       IDENTIFICATION DIVISION.
       PROGRAM-ID. LONGREAD.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER PIC 9(3) VALUE ZERO.
       PROCEDURE DIVISION.
       1000-MAIN.
           PERFORM 2000-LONG
           STOP RUN.
       2000-LONG.
           DISPLAY 'LINE-01'
           DISPLAY 'LINE-02'
           DISPLAY 'LINE-03'
           DISPLAY 'LINE-04'
           DISPLAY 'LINE-05'
           DISPLAY 'LINE-06'
           DISPLAY 'LINE-07'
           DISPLAY 'LINE-08'
           DISPLAY 'LINE-09'
           DISPLAY 'LINE-10'
           DISPLAY 'LINE-11'
           DISPLAY 'LINE-12'
           DISPLAY 'LINE-13'
           DISPLAY 'LINE-14'
           DISPLAY 'LINE-15'
           DISPLAY 'LINE-16'
           DISPLAY 'LINE-17'
           DISPLAY 'LINE-18'
           DISPLAY 'LINE-19'
           DISPLAY 'LINE-20'
           DISPLAY 'LINE-21'
           DISPLAY 'LINE-22'
           DISPLAY 'LINE-23'
           DISPLAY 'LINE-24'
           DISPLAY 'LINE-25'
           DISPLAY 'LINE-26'
           DISPLAY 'LINE-27'
           DISPLAY 'LINE-28'
           DISPLAY 'LINE-29'
           DISPLAY 'LINE-30'
           DISPLAY 'LINE-31'
           DISPLAY 'LINE-32'
           DISPLAY 'LINE-33'
           DISPLAY 'LINE-34'
           DISPLAY 'LINE-35'
           DISPLAY 'LINE-36'
           DISPLAY 'LINE-37'
           DISPLAY 'LINE-38'
           DISPLAY 'LINE-39'
           DISPLAY 'LINE-40'
           DISPLAY 'LINE-41'
           DISPLAY 'LINE-42'
           DISPLAY 'LINE-43'
           DISPLAY 'LINE-44'
           DISPLAY 'LINE-45'
           DISPLAY 'LINE-46'
           DISPLAY 'LINE-47'
           DISPLAY 'LINE-48'
           DISPLAY 'LINE-49'
           DISPLAY 'LINE-50'
           DISPLAY 'LINE-51'
           DISPLAY 'LINE-52'
           DISPLAY 'LINE-53'
           DISPLAY 'LINE-54'
           DISPLAY 'LINE-55'
           DISPLAY 'LINE-56'
           DISPLAY 'LINE-57'
           DISPLAY 'LINE-58'
           DISPLAY 'LINE-59'
           DISPLAY 'LINE-60'
           DISPLAY 'LINE-61'
           DISPLAY 'LINE-62'
           DISPLAY 'LINE-63'
           DISPLAY 'LINE-64'
           DISPLAY 'LINE-65'
           STOP RUN.
