       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEADISO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'MAIN'.
           GOBACK.
      * ISO-PARA is an isolated forest root.
       ISO-PARA.
           DISPLAY 'DEAD COMPLIANCE CHECK'.
           GOBACK.
