      * MO-4 FIXTURE: NPR WAS REMOVED FROM THE OFFICIAL OVD TABLE.
       01  WS-OVD-CODE PIC X(3) VALUE 'PSP'.
           88 VALID-OVD2 VALUES 'PSP' 'DLC' 'ADH' 'VTR' 'NRG'.
